{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attrs": {"__shape__": "(64, 3, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution1_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu0", 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution2_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add0", 
      "inputs": [[10, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution3_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution3_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu1", 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution4_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution4_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add1", 
      "inputs": [[18, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution5_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution5_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu2", 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution6_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution6_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution6", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add2", 
      "inputs": [[26, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution8_weight", 
      "attrs": {"__shape__": "(32, 64, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution8_bias", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution8", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[11, 0, 0], [28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "(0, 0, -1)"}, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution9_weight", 
      "attrs": {"__shape__": "(32, 64, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution9_bias", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution9", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[11, 0, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape2", 
      "attrs": {"shape": "(0, 0, -1)"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot0", 
      "attrs": {
        "transpose_a": "True", 
        "transpose_b": "False"
      }, 
      "inputs": [[31, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution7_weight", 
      "attrs": {"__shape__": "(32, 64, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution7_bias", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution7", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[11, 0, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(0, 0, -1)"}, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot1", 
      "attrs": {
        "transpose_a": "False", 
        "transpose_b": "True"
      }, 
      "inputs": [[37, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose2", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "reshape_like", 
      "name": "reshape_like0", 
      "inputs": [[43, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution10_weight", 
      "attrs": {"__shape__": "(64, 32, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution10_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution10", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3", 
      "inputs": [[47, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution11_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution11_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution11", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu3", 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution12_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution12_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution12", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add4", 
      "inputs": [[55, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution13_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution13_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution13", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution14_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution14_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution14", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[59, 0, 0], [60, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu4", 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution15_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution15_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution15", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add5", 
      "inputs": [[66, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution16_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution16_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution16", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu5", 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution17_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution17_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution17", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[71, 0, 0], [72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add6", 
      "inputs": [[74, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconvolution0_weight", 
      "attrs": {"__shape__": "(64, 64, 6, 6)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "deconvolution0_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconvolution0", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(6, 6)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add7", 
      "inputs": [[56, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution18_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution18_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution18", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[79, 0, 0], [80, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu6", 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution19_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution19_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution19", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[83, 0, 0], [84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add8", 
      "inputs": [[86, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution20_weight", 
      "attrs": {"__shape__": "(64, 64, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution20_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution20", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "sigmoid", 
      "name": "sigmoid0", 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul0", 
      "inputs": [[27, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add9", 
      "inputs": [[92, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution21_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution21_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution21", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[93, 0, 0], [94, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu7", 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution22_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution22_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution22", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[97, 0, 0], [98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add10", 
      "inputs": [[100, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution23_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution23_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution23", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[101, 0, 0], [102, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu8", 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution24_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution24_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution24", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[105, 0, 0], [106, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add11", 
      "inputs": [[108, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution25_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution25_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution25", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution26_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution26_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution26", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu9", 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution27_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution27_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution27", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[116, 0, 0], [117, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add12", 
      "inputs": [[119, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution28_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution28_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution28", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[120, 0, 0], [121, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu10", 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution29_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution29_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution29", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[124, 0, 0], [125, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add13", 
      "inputs": [[127, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution30_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution30_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution30", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[128, 0, 0], [129, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu11", 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution31_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution31_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution31", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[132, 0, 0], [133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add14", 
      "inputs": [[135, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution32_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution32_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution32", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[120, 0, 0], [137, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu12", 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution33_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution33_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution33", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[140, 0, 0], [141, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add15", 
      "inputs": [[143, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution34_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution34_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution34", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[144, 0, 0], [145, 0, 0], [146, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution35_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution35_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution35", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[147, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu13", 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution36_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution36_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution36", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[151, 0, 0], [152, 0, 0], [153, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add16", 
      "inputs": [[154, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution37_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution37_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution37", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[155, 0, 0], [156, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu14", 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution38_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution38_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution38", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[159, 0, 0], [160, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add17", 
      "inputs": [[162, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconvolution1_weight", 
      "attrs": {"__shape__": "(64, 64, 6, 6)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "deconvolution1_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconvolution1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(6, 6)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[163, 0, 0], [164, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add18", 
      "inputs": [[144, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution39_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution39_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution39", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[167, 0, 0], [168, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu15", 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution40_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution40_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution40", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[171, 0, 0], [172, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add19", 
      "inputs": [[174, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution41_weight", 
      "attrs": {"__shape__": "(64, 64, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution41_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution41", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[175, 0, 0], [176, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "sigmoid", 
      "name": "sigmoid1", 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul1", 
      "inputs": [[136, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add20", 
      "inputs": [[180, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution42_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution42_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution42", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[181, 0, 0], [182, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu16", 
      "inputs": [[184, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution43_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution43_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution43", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[185, 0, 0], [186, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add21", 
      "inputs": [[188, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution44_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution44_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution44", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[189, 0, 0], [190, 0, 0], [191, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu17", 
      "inputs": [[192, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution45_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution45_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution45", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[193, 0, 0], [194, 0, 0], [195, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add22", 
      "inputs": [[196, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution46_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution46_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution46", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[197, 0, 0], [198, 0, 0], [199, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution47_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution47_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution47", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[200, 0, 0], [201, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu18", 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution48_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution48_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution48", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[204, 0, 0], [205, 0, 0], [206, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add23", 
      "inputs": [[207, 0, 0], [200, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution49_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution49_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution49", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[208, 0, 0], [209, 0, 0], [210, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu19", 
      "inputs": [[211, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution50_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution50_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution50", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[212, 0, 0], [213, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add24", 
      "inputs": [[215, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution51_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution51_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution51", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[216, 0, 0], [217, 0, 0], [218, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu20", 
      "inputs": [[219, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution52_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution52_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution52", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[220, 0, 0], [221, 0, 0], [222, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add25", 
      "inputs": [[223, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution53_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution53_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution53", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[208, 0, 0], [225, 0, 0], [226, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu21", 
      "inputs": [[227, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution54_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution54_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution54", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[228, 0, 0], [229, 0, 0], [230, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add26", 
      "inputs": [[231, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution55_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution55_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution55", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[232, 0, 0], [233, 0, 0], [234, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution56_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution56_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution56", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[235, 0, 0], [236, 0, 0], [237, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu22", 
      "inputs": [[238, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution57_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution57_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution57", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[239, 0, 0], [240, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add27", 
      "inputs": [[242, 0, 0], [235, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution58_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution58_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution58", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[243, 0, 0], [244, 0, 0], [245, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu23", 
      "inputs": [[246, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution59_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution59_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution59", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[247, 0, 0], [248, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add28", 
      "inputs": [[250, 0, 0], [243, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconvolution2_weight", 
      "attrs": {"__shape__": "(64, 64, 6, 6)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "deconvolution2_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconvolution2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(6, 6)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[251, 0, 0], [252, 0, 0], [253, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add29", 
      "inputs": [[232, 0, 0], [254, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution60_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution60_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution60", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[255, 0, 0], [256, 0, 0], [257, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu24", 
      "inputs": [[258, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution61_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution61_bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution61", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[259, 0, 0], [260, 0, 0], [261, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add30", 
      "inputs": [[262, 0, 0], [255, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution62_weight", 
