{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "reverse_channels_for_caffe_model", 
      "attrs": {"axis": "1"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "F_n1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "F_0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat1", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[7, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution4_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution4", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat2", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[11, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution5_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution5", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat3", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[15, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution6_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution6", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU4", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat4", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[19, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution7_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution7", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU5", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat5", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[23, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution8_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution8", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU6", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat6", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[27, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution9_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution9", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU7", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "Eltwise1", 
      "inputs": [[34, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution10_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution10", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU8", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat7", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[35, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution11_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution11", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU9", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat8", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[39, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution12_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution12", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU10", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat9", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[43, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution13_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution13", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU11", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat10", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[47, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution14_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution14", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU12", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat11", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[51, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution15_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution15", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU13", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat12", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[55, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution16_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution16", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU14", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "Eltwise2", 
      "inputs": [[62, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat37", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[35, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution17_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution17", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[63, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU15", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat13", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[63, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution18_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution18", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU16", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat14", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[68, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution19_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution19", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU17", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat15", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[72, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution20_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution20", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[76, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU18", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat16", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[76, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution21_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution21", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[80, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU19", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat17", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[80, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution22_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution22", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU20", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat18", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[84, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution23_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution23", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU21", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "Eltwise3", 
      "inputs": [[91, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat38", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[64, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution24_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution24", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[92, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU22", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat19", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[92, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution25_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution25", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[97, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU23", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat20", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[97, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution26_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution26", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[101, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU24", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat21", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[101, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution27_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution27", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU25", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat22", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[105, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution28_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution28", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU26", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat23", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[109, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution29_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution29", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[113, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU27", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat24", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[113, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution30_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution30", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[117, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU28", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "Eltwise4", 
      "inputs": [[120, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat39", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[93, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution31_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution31", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[121, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU29", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[124, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat25", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[121, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution32_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution32", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[126, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU30", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat26", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[126, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution33_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution33", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[130, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU31", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat27", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[130, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution34_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution34", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[134, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU32", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat28", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[134, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution35_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution35", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[138, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU33", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat29", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[138, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution36_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution36", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[142, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU34", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[144, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat30", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[142, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution37_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution37", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[146, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU35", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "Eltwise5", 
      "inputs": [[149, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat40", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[122, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution38_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution38", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[150, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU36", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat31", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[150, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution39_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution39", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[155, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU37", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat32", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[155, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution40_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution40", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU38", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[161, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat33", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[159, 0, 0], [162, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution41_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution41", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[163, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU39", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat34", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[163, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution42_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution42", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[167, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU40", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat35", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[167, 0, 0], [170, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution43_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution43", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[171, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU41", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[173, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "Concat36", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[171, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution44_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution44", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[175, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ReLU42", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "block", 
      "inputs": [[178, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "contig_memory", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[151, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution45_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution45", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[180, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "global_fuse", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution46_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution46", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[183, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "F_GF", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "F_DF", 
      "inputs": [[186, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Deconvolution1_weight", 
      "attrs": {
        "kernel": "(6, 6)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "Deconvolution1", 
      "attrs": {
        "kernel": "(6, 6)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(4, 4)"
      }, 
      "inputs": [[187, 0, 0], [188, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "deconv", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution47_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "3", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution47", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "3", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[190, 0, 0], [191, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "reconstruct", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[192, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    5, 
    8, 
    12, 
    16, 
    20, 
    24, 
    28, 
    32, 
    36, 
    40, 
    44, 
    48, 
    52, 
    56, 
    60, 
    65, 
    69, 
    73, 
    77, 
    81, 
    85, 
    89, 
    94, 
    98, 
    102, 
    106, 
    110, 
    114, 
    118, 
    123, 
    127, 
    131, 
    135, 
    139, 
    143, 
    147, 
    152, 
    156, 
    160, 
    164, 
    168, 
    172, 
    176, 
    181, 
    184, 
    188, 
    191
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143, 
    144, 
    145, 
    146, 
    147, 
    148, 
    149, 
    150, 
    151, 
    152, 
    153, 
    154, 
    155, 
    156, 
    157, 
    158, 
    159, 
    160, 
    161, 
    162, 
    163, 
    164, 
    165, 
    166, 
    167, 
    168, 
    169, 
    170, 
    171, 
    172, 
    173, 
    174, 
    175, 
    176, 
    177, 
    178, 
    179, 
    180, 
    181, 
    182, 
    183, 
    184, 
    185, 
    186, 
    187, 
    188, 
    189, 
    190, 
    191, 
    192, 
    193, 
    194
  ], 
  "heads": [[193, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10300]}
}