{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_block1.0.weight", 
      "attrs": {"__shape__": "(48, 3, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_block1.0.bias", 
      "attrs": {"__shape__": "(48,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu0", 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_block1.2.weight", 
      "attrs": {"__shape__": "(48, 48, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_block1.2.bias", 
      "attrs": {"__shape__": "(48,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu1", 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad0", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_block2.0.weight", 
      "attrs": {"__shape__": "(48, 48, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_block2.0.bias", 
      "attrs": {"__shape__": "(48,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu2", 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad1", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling1", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[16, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu3", 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad2", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling2", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[20, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu4", 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad3", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling3", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[24, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu5", 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad4", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling4", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_block3.0.weight", 
      "attrs": {"__shape__": "(48, 48, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_block3.0.bias", 
      "attrs": {"__shape__": "(48,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution6", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu6", 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_block3.2.weight", 
      "attrs": {"__shape__": "(48, 48, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_block3.2.bias", 
      "attrs": {"__shape__": "(48,)"}, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconvolution0", 
      "attrs": {
        "adj": "(1, 1)", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[35, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_block4.0.weight", 
      "attrs": {"__shape__": "(96, 96, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_block4.0.bias", 
      "attrs": {"__shape__": "(96,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution7", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu7", 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_block4.2.weight", 
      "attrs": {"__shape__": "(96, 96, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_block4.2.bias", 
      "attrs": {"__shape__": "(96,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution8", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu8", 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_block4.4.weight", 
      "attrs": {"__shape__": "(96, 96, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_block4.4.bias", 
      "attrs": {"__shape__": "(96,)"}, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconvolution1", 
      "attrs": {
        "adj": "(1, 1)", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[47, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_block5.0.weight", 
      "attrs": {"__shape__": "(96, 144, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_block5.0.bias", 
      "attrs": {"__shape__": "(96,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution9", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu9", 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_block5.2.weight", 
      "attrs": {"__shape__": "(96, 96, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_block5.2.bias", 
      "attrs": {"__shape__": "(96,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution10", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu10", 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_block5.4.weight", 
      "attrs": {"__shape__": "(96, 96, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_block5.4.bias", 
      "attrs": {"__shape__": "(96,)"}, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconvolution2", 
      "attrs": {
        "adj": "(1, 1)", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat2", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[59, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "convolution11", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[60, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu11", 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "convolution12", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[62, 0, 0], [53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu12", 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconvolution3", 
      "attrs": {
        "adj": "(1, 1)", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[64, 0, 0], [57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat3", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[65, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "convolution13", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[66, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu13", 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "convolution14", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[68, 0, 0], [53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu14", 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconvolution4", 
      "attrs": {
        "adj": "(1, 1)", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[70, 0, 0], [57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat4", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[71, 0, 0], [0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_block6.0.weight", 
      "attrs": {"__shape__": "(64, 99, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_block6.0.bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution15", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu15", 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_block6.2.weight", 
      "attrs": {"__shape__": "(32, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_block6.2.bias", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution16", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[76, 0, 0], [77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu16", 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_block6.4.weight", 
      "attrs": {"__shape__": "(3, 32, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_block6.4.bias", 
      "attrs": {"__shape__": "(3,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution17", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "3", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[80, 0, 0], [81, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu0", 
      "attrs": {"slope": "0.10000000149011612"}, 
      "inputs": [[83, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    5, 
    6, 
    11, 
    12, 
    29, 
    30, 
    33, 
    34, 
    37, 
    38, 
    41, 
    42, 
    45, 
    46, 
    49, 
    50, 
    53, 
    54, 
    57, 
    58, 
    73, 
    74, 
    77, 
    78, 
    81, 
    82
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85
  ], 
  "heads": [[84, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10300]}
}