{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "Pad", 
      "name": "pad0", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 4, 4, 4, 4)"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_0", 
      "attrs": {"__shape__": "(64, 3, 9, 9)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_1", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(9, 9)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "sigmoid", 
      "name": "sigmoid0", 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul0", 
      "inputs": [[4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad1", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_2", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_3", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_4", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_5", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_6", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_7", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm0", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 1], [14, 0, 1]]
    }, 
    {
      "op": "sigmoid", 
      "name": "sigmoid1", 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul1", 
      "inputs": [[15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad2", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_8", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_9", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_10", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_11", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_12", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_13", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm1", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 1], [25, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add0", 
      "inputs": [[26, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad3", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_14", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_15", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_16", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_17", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_18", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_19", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm2", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 1], [35, 0, 1]]
    }, 
    {
      "op": "sigmoid", 
      "name": "sigmoid2", 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul2", 
      "inputs": [[36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad4", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_20", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_21", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_22", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_23", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_24", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_25", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm3", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0], [45, 0, 1], [46, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add1", 
      "inputs": [[47, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad5", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_26", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_27", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_28", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_29", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_30", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_31", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm4", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 0], [54, 0, 0], [55, 0, 1], [56, 0, 1]]
    }, 
    {
      "op": "sigmoid", 
      "name": "sigmoid3", 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3", 
      "inputs": [[57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad6", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_32", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_33", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution6", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_34", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_35", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_36", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_37", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm5", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0], [65, 0, 0], [66, 0, 1], [67, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add2", 
      "inputs": [[68, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad7", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_38", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_39", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution7", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_40", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_41", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_42", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_43", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm6", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[73, 0, 0], [74, 0, 0], [75, 0, 0], [76, 0, 1], [77, 0, 1]]
    }, 
    {
      "op": "sigmoid", 
      "name": "sigmoid4", 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul4", 
      "inputs": [[78, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad8", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_44", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_45", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution8", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[81, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_46", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_47", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_48", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_49", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm7", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0], [86, 0, 0], [87, 0, 1], [88, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3", 
      "inputs": [[89, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad9", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_50", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_51", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution9", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[91, 0, 0], [92, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_52", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_53", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_54", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_55", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm8", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[94, 0, 0], [95, 0, 0], [96, 0, 0], [97, 0, 1], [98, 0, 1]]
    }, 
    {
      "op": "sigmoid", 
      "name": "sigmoid5", 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul5", 
      "inputs": [[99, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad10", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_56", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_57", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution10", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[102, 0, 0], [103, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_58", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_59", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_60", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_61", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm9", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[105, 0, 0], [106, 0, 0], [107, 0, 0], [108, 0, 1], [109, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add4", 
      "inputs": [[110, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad11", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_62", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_63", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution11", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_64", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_65", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_66", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_67", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm10", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[115, 0, 0], [116, 0, 0], [117, 0, 0], [118, 0, 1], [119, 0, 1]]
    }, 
    {
      "op": "sigmoid", 
      "name": "sigmoid6", 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul6", 
      "inputs": [[120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad12", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_68", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_69", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution12", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[123, 0, 0], [124, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_70", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_71", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_72", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_73", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm11", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[126, 0, 0], [127, 0, 0], [128, 0, 0], [129, 0, 1], [130, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add5", 
      "inputs": [[131, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad13", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_74", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_75", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution13", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[133, 0, 0], [134, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_76", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_77", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_78", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_79", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm12", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[136, 0, 0], [137, 0, 0], [138, 0, 0], [139, 0, 1], [140, 0, 1]]
    }, 
    {
      "op": "sigmoid", 
      "name": "sigmoid7", 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul7", 
      "inputs": [[141, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad14", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_80", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_81", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution14", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[144, 0, 0], [145, 0, 0], [146, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_82", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_83", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_84", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_85", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm13", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[147, 0, 0], [148, 0, 0], [149, 0, 0], [150, 0, 1], [151, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add6", 
      "inputs": [[152, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad15", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_86", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_87", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution15", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[154, 0, 0], [155, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_88", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_89", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_90", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_91", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm14", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[157, 0, 0], [158, 0, 0], [159, 0, 0], [160, 0, 1], [161, 0, 1]]
    }, 
    {
      "op": "sigmoid", 
      "name": "sigmoid8", 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul8", 
      "inputs": [[162, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad16", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_92", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_93", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution16", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[165, 0, 0], [166, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_94", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_95", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_96", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_97", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm15", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[168, 0, 0], [169, 0, 0], [170, 0, 0], [171, 0, 1], [172, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add7", 
      "inputs": [[173, 0, 0], [153, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad17", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_98", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_99", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution17", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[175, 0, 0], [176, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_100", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_101", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_102", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_103", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm16", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[178, 0, 0], [179, 0, 0], [180, 0, 0], [181, 0, 1], [182, 0, 1]]
    }, 
    {
      "op": "sigmoid", 
      "name": "sigmoid9", 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul9", 
      "inputs": [[183, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad18", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_104", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_105", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution18", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[186, 0, 0], [187, 0, 0], [188, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_106", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_107", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_108", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_109", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm17", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[189, 0, 0], [190, 0, 0], [191, 0, 0], [192, 0, 1], [193, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add8", 
      "inputs": [[194, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad19", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_110", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_111", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution19", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[196, 0, 0], [197, 0, 0], [198, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_112", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_113", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_114", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_115", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm18", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[199, 0, 0], [200, 0, 0], [201, 0, 0], [202, 0, 1], [203, 0, 1]]
    }, 
    {
      "op": "sigmoid", 
      "name": "sigmoid10", 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul10", 
      "inputs": [[204, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad20", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_116", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_117", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution20", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[207, 0, 0], [208, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_118", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_119", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_120", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_121", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm19", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[210, 0, 0], [211, 0, 0], [212, 0, 0], [213, 0, 1], [214, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add9", 
      "inputs": [[215, 0, 0], [195, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad21", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[216, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_122", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_123", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution21", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[217, 0, 0], [218, 0, 0], [219, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_124", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_125", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_126", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_127", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm20", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[220, 0, 0], [221, 0, 0], [222, 0, 0], [223, 0, 1], [224, 0, 1]]
    }, 
    {
      "op": "sigmoid", 
      "name": "sigmoid11", 
      "inputs": [[225, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul11", 
      "inputs": [[225, 0, 0], [226, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad22", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[227, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_128", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_129", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution22", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[228, 0, 0], [229, 0, 0], [230, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_130", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_131", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_132", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_133", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm21", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[231, 0, 0], [232, 0, 0], [233, 0, 0], [234, 0, 1], [235, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add10", 
      "inputs": [[236, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad23", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_134", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_135", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution23", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[238, 0, 0], [239, 0, 0], [240, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_136", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_137", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_138", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_139", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm22", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[241, 0, 0], [242, 0, 0], [243, 0, 0], [244, 0, 1], [245, 0, 1]]
    }, 
    {
      "op": "sigmoid", 
      "name": "sigmoid12", 
      "inputs": [[246, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul12", 
      "inputs": [[246, 0, 0], [247, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad24", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[248, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_140", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_141", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution24", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[249, 0, 0], [250, 0, 0], [251, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_142", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_143", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_144", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_145", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm23", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[252, 0, 0], [253, 0, 0], [254, 0, 0], [255, 0, 1], [256, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add11", 
      "inputs": [[257, 0, 0], [237, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad25", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[258, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_146", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_147", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution25", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[259, 0, 0], [260, 0, 0], [261, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_148", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_149", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_150", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_151", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm24", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[262, 0, 0], [263, 0, 0], [264, 0, 0], [265, 0, 1], [266, 0, 1]]
    }, 
    {
      "op": "sigmoid", 
      "name": "sigmoid13", 
      "inputs": [[267, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul13", 
      "inputs": [[267, 0, 0], [268, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad26", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[269, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_152", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_153", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution26", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[270, 0, 0], [271, 0, 0], [272, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_154", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_155", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_156", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_157", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm25", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[273, 0, 0], [274, 0, 0], [275, 0, 0], [276, 0, 1], [277, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add12", 
      "inputs": [[278, 0, 0], [258, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad27", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[279, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_158", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_159", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution27", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
