{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_0", 
      "attrs": {"__shape__": "(64, 1, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu0", 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_1", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu1", 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add0", 
      "inputs": [[3, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_2", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu2", 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add1", 
      "inputs": [[3, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_3", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu3", 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add2", 
      "inputs": [[3, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_4", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu4", 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3", 
      "inputs": [[3, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_5", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu5", 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add4", 
      "inputs": [[3, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_6", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution6", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu6", 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add5", 
      "inputs": [[3, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_7", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution7", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu7", 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add6", 
      "inputs": [[3, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_8", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution8", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu8", 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add7", 
      "inputs": [[3, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_9", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution9", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu9", 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add8", 
      "inputs": [[3, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_10", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution10", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu10", 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add9", 
      "inputs": [[3, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_11", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution11", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu11", 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add10", 
      "inputs": [[3, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_12", 
      "attrs": {"__shape__": "(4, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution12", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "4", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu12", 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "depth_to_space", 
      "name": "depth_to_space0", 
      "attrs": {"block_size": "2"}, 
      "inputs": [[50, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    4, 
    8, 
    12, 
    16, 
    20, 
    24, 
    28, 
    32, 
    36, 
    40, 
    44, 
    48
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52
  ], 
  "heads": [[51, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10300]}
}