{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "body.0.weight", 
      "attrs": {"__shape__": "(16, 3, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "body.0.bias", 
      "attrs": {"__shape__": "(16,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "body.1.weight", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "__shape__": "(16,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu0", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "body.2.weight", 
      "attrs": {"__shape__": "(32, 16, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "body.2.bias", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "body.3.weight", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "__shape__": "(32,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu1", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "body.4.weight", 
      "attrs": {"__shape__": "(64, 32, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "body.4.bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "body.5.weight", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu2", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "body.6.weight", 
      "attrs": {"__shape__": "(128, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "body.6.bias", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "body.7.weight", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "__shape__": "(128,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu3", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "body.8.weight", 
      "attrs": {"__shape__": "(128, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "body.8.bias", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "body.9.weight", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "__shape__": "(128,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu4", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "tail.0.0.weight", 
      "attrs": {"__shape__": "(512, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "tail.0.0.bias", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[25, 0, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(0, -4, -1, 4, 0, 0)"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "(0, 0, -4, 2, 2, 0, 0)"}, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose0", 
      "attrs": {"axes": "(0, 1, 4, 2, 5, 3)"}, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape2", 
      "attrs": {"shape": "(0, 0, -3, -3)"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "tail.1.weight", 
      "attrs": {"__shape__": "(3, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "tail.1.bias", 
      "attrs": {"__shape__": "(3,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution6", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "3", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    6, 
    7, 
    9, 
    11, 
    12, 
    14, 
    16, 
    17, 
    19, 
    21, 
    22, 
    24, 
    26, 
    27, 
    33, 
    34
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36
  ], 
  "heads": [[35, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10300]}
}