{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_input.weight", 
      "attrs": {"__shape__": "(64, 1, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual1.0.conv_3_1.weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual1.0.conv_3_1.bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu0", 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual1.0.conv_5_1.weight", 
      "attrs": {"__shape__": "(64, 64, 5, 5)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual1.0.conv_5_1.bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[2, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu1", 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[6, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual1.0.conv_3_2.weight", 
      "attrs": {"__shape__": "(128, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual1.0.conv_3_2.bias", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu2", 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual1.0.conv_5_2.weight", 
      "attrs": {"__shape__": "(128, 128, 5, 5)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual1.0.conv_5_2.bias", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[11, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu3", 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[15, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual1.0.confusion.weight", 
      "attrs": {"__shape__": "(64, 256, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add0", 
      "inputs": [[22, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual2.0.conv_3_1.weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual2.0.conv_3_1.bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution6", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu4", 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual2.0.conv_5_1.weight", 
      "attrs": {"__shape__": "(64, 64, 5, 5)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual2.0.conv_5_1.bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution7", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[23, 0, 0], [28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu5", 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat2", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[27, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual2.0.conv_3_2.weight", 
      "attrs": {"__shape__": "(128, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual2.0.conv_3_2.bias", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution8", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu6", 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual2.0.conv_5_2.weight", 
      "attrs": {"__shape__": "(128, 128, 5, 5)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual2.0.conv_5_2.bias", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution9", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[32, 0, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu7", 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat3", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[36, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual2.0.confusion.weight", 
      "attrs": {"__shape__": "(64, 256, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution10", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add1", 
      "inputs": [[43, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual3.0.conv_3_1.weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual3.0.conv_3_1.bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution11", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu8", 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual3.0.conv_5_1.weight", 
      "attrs": {"__shape__": "(64, 64, 5, 5)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual3.0.conv_5_1.bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution12", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[44, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu9", 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat4", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[48, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual3.0.conv_3_2.weight", 
      "attrs": {"__shape__": "(128, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual3.0.conv_3_2.bias", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution13", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[53, 0, 0], [54, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu10", 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual3.0.conv_5_2.weight", 
      "attrs": {"__shape__": "(128, 128, 5, 5)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual3.0.conv_5_2.bias", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution14", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[53, 0, 0], [58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu11", 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat5", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[57, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual3.0.confusion.weight", 
      "attrs": {"__shape__": "(64, 256, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution15", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add2", 
      "inputs": [[64, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual4.0.conv_3_1.weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual4.0.conv_3_1.bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution16", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[65, 0, 0], [66, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu12", 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual4.0.conv_5_1.weight", 
      "attrs": {"__shape__": "(64, 64, 5, 5)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual4.0.conv_5_1.bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution17", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[65, 0, 0], [70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu13", 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat6", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[69, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual4.0.conv_3_2.weight", 
      "attrs": {"__shape__": "(128, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual4.0.conv_3_2.bias", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution18", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu14", 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual4.0.conv_5_2.weight", 
      "attrs": {"__shape__": "(128, 128, 5, 5)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual4.0.conv_5_2.bias", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution19", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[74, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu15", 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat7", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[78, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual4.0.confusion.weight", 
      "attrs": {"__shape__": "(64, 256, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution20", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3", 
      "inputs": [[85, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual5.0.conv_3_1.weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual5.0.conv_3_1.bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution21", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu16", 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual5.0.conv_5_1.weight", 
      "attrs": {"__shape__": "(64, 64, 5, 5)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual5.0.conv_5_1.bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution22", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[86, 0, 0], [91, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu17", 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat8", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[90, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual5.0.conv_3_2.weight", 
      "attrs": {"__shape__": "(128, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual5.0.conv_3_2.bias", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution23", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu18", 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual5.0.conv_5_2.weight", 
      "attrs": {"__shape__": "(128, 128, 5, 5)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual5.0.conv_5_2.bias", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution24", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[95, 0, 0], [100, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu19", 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat9", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[99, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual5.0.confusion.weight", 
      "attrs": {"__shape__": "(64, 256, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution25", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add4", 
      "inputs": [[106, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual6.0.conv_3_1.weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual6.0.conv_3_1.bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution26", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[107, 0, 0], [108, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu20", 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual6.0.conv_5_1.weight", 
      "attrs": {"__shape__": "(64, 64, 5, 5)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual6.0.conv_5_1.bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution27", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[107, 0, 0], [112, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu21", 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat10", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[111, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual6.0.conv_3_2.weight", 
      "attrs": {"__shape__": "(128, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual6.0.conv_3_2.bias", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution28", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[116, 0, 0], [117, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu22", 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual6.0.conv_5_2.weight", 
      "attrs": {"__shape__": "(128, 128, 5, 5)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual6.0.conv_5_2.bias", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution29", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[116, 0, 0], [121, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu23", 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat11", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[120, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual6.0.confusion.weight", 
      "attrs": {"__shape__": "(64, 256, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution30", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[125, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add5", 
      "inputs": [[127, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual7.0.conv_3_1.weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual7.0.conv_3_1.bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution31", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[128, 0, 0], [129, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu24", 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual7.0.conv_5_1.weight", 
      "attrs": {"__shape__": "(64, 64, 5, 5)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual7.0.conv_5_1.bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution32", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[128, 0, 0], [133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu25", 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat12", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[132, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual7.0.conv_3_2.weight", 
      "attrs": {"__shape__": "(128, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual7.0.conv_3_2.bias", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution33", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[137, 0, 0], [138, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu26", 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual7.0.conv_5_2.weight", 
      "attrs": {"__shape__": "(128, 128, 5, 5)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual7.0.conv_5_2.bias", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution34", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[137, 0, 0], [142, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu27", 
      "inputs": [[144, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat13", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[141, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual7.0.confusion.weight", 
      "attrs": {"__shape__": "(64, 256, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution35", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[146, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add6", 
      "inputs": [[148, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual8.0.conv_3_1.weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual8.0.conv_3_1.bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution36", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[149, 0, 0], [150, 0, 0], [151, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu28", 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual8.0.conv_5_1.weight", 
      "attrs": {"__shape__": "(64, 64, 5, 5)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual8.0.conv_5_1.bias", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution37", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[149, 0, 0], [154, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu29", 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat14", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[153, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual8.0.conv_3_2.weight", 
      "attrs": {"__shape__": "(128, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual8.0.conv_3_2.bias", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution38", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[158, 0, 0], [159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu30", 
      "inputs": [[161, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual8.0.conv_5_2.weight", 
      "attrs": {"__shape__": "(128, 128, 5, 5)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "residual8.0.conv_5_2.bias", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution39", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[158, 0, 0], [163, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu31", 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat15", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[162, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "residual8.0.confusion.weight", 
      "attrs": {"__shape__": "(64, 256, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution40", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[167, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add7", 
      "inputs": [[169, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat16", 
      "attrs": {
        "dim": "1", 
        "num_args": "9"
      }, 
      "inputs": [[2, 0, 0], [23, 0, 0], [44, 0, 0], [65, 0, 0], [86, 0, 0], [107, 0, 0], [128, 0, 0], [149, 0, 0], [170, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bottle.weight", 
      "attrs": {"__shape__": "(64, 576, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution41", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[171, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_2x.weight", 
      "attrs": {"__shape__": "(576, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution42", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "576", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[173, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(0, -4, -1, 9, 0, 0)"}, 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "(0, 0, -4, 3, 3, 0, 0)"}, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose0", 
      "attrs": {"axes": "(0, 1, 4, 2, 5, 3)"}, 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape2", 
      "attrs": {"shape": "(0, 0, -3, -3)"}, 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_output.weight", 
      "attrs": {"__shape__": "(1, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution43", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "1", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[179, 0, 0], [180, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    4, 
    7, 
    8, 
    12, 
    13, 
    16, 
    17, 
    21, 
    24, 
    25, 
    28, 
    29, 
    33, 
    34, 
    37, 
    38, 
    42, 
    45, 
    46, 
    49, 
    50, 
    54, 
    55, 
    58, 
    59, 
    63, 
    66, 
    67, 
    70, 
    71, 
    75, 
    76, 
    79, 
    80, 
    84, 
    87, 
    88, 
    91, 
    92, 
    96, 
    97, 
    100, 
    101, 
    105, 
    108, 
    109, 
    112, 
    113, 
    117, 
    118, 
    121, 
    122, 
    126, 
    129, 
    130, 
    133, 
    134, 
    138, 
    139, 
    142, 
    143, 
    147, 
    150, 
    151, 
    154, 
    155, 
    159, 
    160, 
    163, 
    164, 
    168, 
    172, 
    174, 
    180
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143, 
    144, 
    145, 
    146, 
    147, 
    148, 
    149, 
    150, 
    151, 
    152, 
    153, 
    154, 
    155, 
    156, 
    157, 
    158, 
    159, 
    160, 
    161, 
    162, 
    163, 
    164, 
    165, 
    166, 
    167, 
    168, 
    169, 
    170, 
    171, 
    172, 
    173, 
    174, 
    175, 
    176, 
    177, 
    178, 
    179, 
    180, 
    181, 
    182
  ], 
  "heads": [[181, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10300]}
}