{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_0", 
      "attrs": {"__shape__": "(64, 3, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_1", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_2", 
      "attrs": {"__shape__": "(32, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_3", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu0", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[3, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_4", 
      "attrs": {"__shape__": "(32, 96, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_5", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu1", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[3, 0, 0], [7, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_6", 
      "attrs": {"__shape__": "(32, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_7", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu2", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat2", 
      "attrs": {
        "dim": "1", 
        "num_args": "4"
      }, 
      "inputs": [[3, 0, 0], [7, 0, 0], [12, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_8", 
      "attrs": {"__shape__": "(32, 160, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_9", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu3", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat3", 
      "attrs": {
        "dim": "1", 
        "num_args": "5"
      }, 
      "inputs": [[3, 0, 0], [7, 0, 0], [12, 0, 0], [17, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_10", 
      "attrs": {"__shape__": "(64, 192, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_11", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attrs": {"scalar": "0.2"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add0", 
      "inputs": [[27, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_12", 
      "attrs": {"__shape__": "(32, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_13", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution6", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu4", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat4", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[28, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_14", 
      "attrs": {"__shape__": "(32, 96, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_15", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution7", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu5", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat5", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[28, 0, 0], [32, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_16", 
      "attrs": {"__shape__": "(32, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_17", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution8", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[38, 0, 0], [39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu6", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat6", 
      "attrs": {
        "dim": "1", 
        "num_args": "4"
      }, 
      "inputs": [[28, 0, 0], [32, 0, 0], [37, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_18", 
      "attrs": {"__shape__": "(32, 160, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_19", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution9", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu7", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat7", 
      "attrs": {
        "dim": "1", 
        "num_args": "5"
      }, 
      "inputs": [[28, 0, 0], [32, 0, 0], [37, 0, 0], [42, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_20", 
      "attrs": {"__shape__": "(64, 192, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_21", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution10", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar1", 
      "attrs": {"scalar": "0.2"}, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add1", 
      "inputs": [[52, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_22", 
      "attrs": {"__shape__": "(32, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_23", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution11", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[53, 0, 0], [54, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu8", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat8", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[53, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_24", 
      "attrs": {"__shape__": "(32, 96, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_25", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution12", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu9", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat9", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[53, 0, 0], [57, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_26", 
      "attrs": {"__shape__": "(32, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_27", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution13", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu10", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat10", 
      "attrs": {
        "dim": "1", 
        "num_args": "4"
      }, 
      "inputs": [[53, 0, 0], [57, 0, 0], [62, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_28", 
      "attrs": {"__shape__": "(32, 160, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_29", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution14", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[68, 0, 0], [69, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu11", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat11", 
      "attrs": {
        "dim": "1", 
        "num_args": "5"
      }, 
      "inputs": [[53, 0, 0], [57, 0, 0], [62, 0, 0], [67, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_30", 
      "attrs": {"__shape__": "(64, 192, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_31", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution15", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[73, 0, 0], [74, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar2", 
      "attrs": {"scalar": "0.2"}, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add2", 
      "inputs": [[77, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3", 
      "attrs": {"scalar": "0.2"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3", 
      "inputs": [[79, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_32", 
      "attrs": {"__shape__": "(32, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_33", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution16", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[80, 0, 0], [81, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu12", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat12", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[80, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_34", 
      "attrs": {"__shape__": "(32, 96, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_35", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution17", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[85, 0, 0], [86, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu13", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat13", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[80, 0, 0], [84, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_36", 
      "attrs": {"__shape__": "(32, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_37", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution18", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[90, 0, 0], [91, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu14", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat14", 
      "attrs": {
        "dim": "1", 
        "num_args": "4"
      }, 
      "inputs": [[80, 0, 0], [84, 0, 0], [89, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_38", 
      "attrs": {"__shape__": "(32, 160, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_39", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution19", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu15", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat15", 
      "attrs": {
        "dim": "1", 
        "num_args": "5"
      }, 
      "inputs": [[80, 0, 0], [84, 0, 0], [89, 0, 0], [94, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_40", 
      "attrs": {"__shape__": "(64, 192, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_41", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution20", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[100, 0, 0], [101, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar4", 
      "attrs": {"scalar": "0.2"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add4", 
      "inputs": [[104, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_42", 
      "attrs": {"__shape__": "(32, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_43", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution21", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[105, 0, 0], [106, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu16", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat16", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[105, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_44", 
      "attrs": {"__shape__": "(32, 96, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_45", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution22", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[110, 0, 0], [111, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu17", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat17", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[105, 0, 0], [109, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_46", 
      "attrs": {"__shape__": "(32, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_47", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution23", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[115, 0, 0], [116, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu18", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat18", 
      "attrs": {
        "dim": "1", 
        "num_args": "4"
      }, 
      "inputs": [[105, 0, 0], [109, 0, 0], [114, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_48", 
      "attrs": {"__shape__": "(32, 160, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_49", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution24", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[120, 0, 0], [121, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu19", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat19", 
      "attrs": {
        "dim": "1", 
        "num_args": "5"
      }, 
      "inputs": [[105, 0, 0], [109, 0, 0], [114, 0, 0], [119, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_50", 
      "attrs": {"__shape__": "(64, 192, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_51", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution25", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[125, 0, 0], [126, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar5", 
      "attrs": {"scalar": "0.2"}, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add5", 
      "inputs": [[129, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_52", 
      "attrs": {"__shape__": "(32, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_53", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution26", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[130, 0, 0], [131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu20", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat20", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[130, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_54", 
      "attrs": {"__shape__": "(32, 96, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_55", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution27", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[135, 0, 0], [136, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu21", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat21", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[130, 0, 0], [134, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_56", 
      "attrs": {"__shape__": "(32, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_57", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution28", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[140, 0, 0], [141, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu22", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat22", 
      "attrs": {
        "dim": "1", 
        "num_args": "4"
      }, 
      "inputs": [[130, 0, 0], [134, 0, 0], [139, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_58", 
      "attrs": {"__shape__": "(32, 160, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_59", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution29", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[145, 0, 0], [146, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu23", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat23", 
      "attrs": {
        "dim": "1", 
        "num_args": "5"
      }, 
      "inputs": [[130, 0, 0], [134, 0, 0], [139, 0, 0], [144, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_60", 
      "attrs": {"__shape__": "(64, 192, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_61", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution30", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[150, 0, 0], [151, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar6", 
      "attrs": {"scalar": "0.2"}, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add6", 
      "inputs": [[154, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar7", 
      "attrs": {"scalar": "0.2"}, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add7", 
      "inputs": [[156, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_62", 
      "attrs": {"__shape__": "(32, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_63", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution31", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[157, 0, 0], [158, 0, 0], [159, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu24", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat24", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[157, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_64", 
      "attrs": {"__shape__": "(32, 96, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_65", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution32", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[162, 0, 0], [163, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu25", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat25", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[157, 0, 0], [161, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_66", 
      "attrs": {"__shape__": "(32, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_67", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution33", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[167, 0, 0], [168, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu26", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat26", 
      "attrs": {
        "dim": "1", 
        "num_args": "4"
      }, 
      "inputs": [[157, 0, 0], [161, 0, 0], [166, 0, 0], [171, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_68", 
      "attrs": {"__shape__": "(32, 160, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_69", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution34", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[172, 0, 0], [173, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu27", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat27", 
      "attrs": {
        "dim": "1", 
        "num_args": "5"
      }, 
      "inputs": [[157, 0, 0], [161, 0, 0], [166, 0, 0], [171, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_70", 
      "attrs": {"__shape__": "(64, 192, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_71", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution35", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[177, 0, 0], [178, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar8", 
      "attrs": {"scalar": "0.2"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add8", 
      "inputs": [[181, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_72", 
      "attrs": {"__shape__": "(32, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_73", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution36", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[182, 0, 0], [183, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu28", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat28", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[182, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_74", 
      "attrs": {"__shape__": "(32, 96, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_75", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution37", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[187, 0, 0], [188, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu29", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat29", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[182, 0, 0], [186, 0, 0], [191, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_76", 
      "attrs": {"__shape__": "(32, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_77", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution38", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[192, 0, 0], [193, 0, 0], [194, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu30", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat30", 
      "attrs": {
        "dim": "1", 
        "num_args": "4"
      }, 
      "inputs": [[182, 0, 0], [186, 0, 0], [191, 0, 0], [196, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_78", 
      "attrs": {"__shape__": "(32, 160, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_79", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution39", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[197, 0, 0], [198, 0, 0], [199, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu31", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[200, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat31", 
      "attrs": {
        "dim": "1", 
        "num_args": "5"
      }, 
      "inputs": [[182, 0, 0], [186, 0, 0], [191, 0, 0], [196, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_80", 
      "attrs": {"__shape__": "(64, 192, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_81", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution40", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[202, 0, 0], [203, 0, 0], [204, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar9", 
      "attrs": {"scalar": "0.2"}, 
      "inputs": [[205, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add9", 
      "inputs": [[206, 0, 0], [182, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_82", 
      "attrs": {"__shape__": "(32, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_83", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution41", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[207, 0, 0], [208, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu32", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[210, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat32", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[207, 0, 0], [211, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_84", 
      "attrs": {"__shape__": "(32, 96, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_85", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution42", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[212, 0, 0], [213, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu33", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[215, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat33", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[207, 0, 0], [211, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_86", 
      "attrs": {"__shape__": "(32, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_87", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution43", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[217, 0, 0], [218, 0, 0], [219, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu34", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[220, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat34", 
      "attrs": {
        "dim": "1", 
        "num_args": "4"
      }, 
      "inputs": [[207, 0, 0], [211, 0, 0], [216, 0, 0], [221, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_88", 
      "attrs": {"__shape__": "(32, 160, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_89", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution44", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[222, 0, 0], [223, 0, 0], [224, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu35", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[225, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat35", 
      "attrs": {
        "dim": "1", 
        "num_args": "5"
      }, 
      "inputs": [[207, 0, 0], [211, 0, 0], [216, 0, 0], [221, 0, 0], [226, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_90", 
      "attrs": {"__shape__": "(64, 192, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_91", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution45", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[227, 0, 0], [228, 0, 0], [229, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar10", 
      "attrs": {"scalar": "0.2"}, 
      "inputs": [[230, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add10", 
      "inputs": [[231, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar11", 
      "attrs": {"scalar": "0.2"}, 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add11", 
      "inputs": [[233, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_92", 
      "attrs": {"__shape__": "(32, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_93", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution46", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[234, 0, 0], [235, 0, 0], [236, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu36", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat36", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[234, 0, 0], [238, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_94", 
      "attrs": {"__shape__": "(32, 96, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_95", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution47", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[239, 0, 0], [240, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu37", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[242, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat37", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[234, 0, 0], [238, 0, 0], [243, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_96", 
      "attrs": {"__shape__": "(32, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_97", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution48", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[244, 0, 0], [245, 0, 0], [246, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu38", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[247, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat38", 
      "attrs": {
        "dim": "1", 
        "num_args": "4"
      }, 
      "inputs": [[234, 0, 0], [238, 0, 0], [243, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_98", 
      "attrs": {"__shape__": "(32, 160, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_99", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution49", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[249, 0, 0], [250, 0, 0], [251, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu39", 
      "attrs": {"slope": "0.20000000298023224"}, 
      "inputs": [[252, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat39", 
      "attrs": {
        "dim": "1", 
        "num_args": "5"
      }, 
      "inputs": [[234, 0, 0], [238, 0, 0], [243, 0, 0], [248, 0, 0], [253, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_100", 
      "attrs": {"__shape__": "(64, 192, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_101", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution50", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[254, 0, 0], [255, 0, 0], [256, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar12", 
      "attrs": {"scalar": "0.2"}, 
      "inputs": [[257, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add12", 
      "inputs": [[258, 0, 0], [234, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_102", 
      "attrs": {"__shape__": "(32, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_103", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution51", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
