{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(0, 1, 64, 64)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2d_1/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 1, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_1/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_1/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add1", 
      "inputs": [[2, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu1", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_2/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_2/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_2/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape3", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3", 
      "inputs": [[8, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu3", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_3/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_3/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_3/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape5", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add5", 
      "inputs": [[14, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu5", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_4/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_4/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_4/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape7", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add7", 
      "inputs": [[20, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu7", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_5/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_5/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_5/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape9", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add9", 
      "inputs": [[26, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu9", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_6/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_6/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_6/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape11", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add11", 
      "inputs": [[32, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu11", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_7/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_7/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_7/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape13", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add13", 
      "inputs": [[38, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu13", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_8/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_8/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_8/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape15", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add15", 
      "inputs": [[44, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu15", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_9/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_9/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_9/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape17", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add17", 
      "inputs": [[50, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu17", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_10/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_10/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[54, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_10/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape19", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add19", 
      "inputs": [[56, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu19", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_11/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_11/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_11/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape21", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add21", 
      "inputs": [[62, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu21", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_12/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_12/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_12/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape23", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add23", 
      "inputs": [[68, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu23", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_13/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_13/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_13/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape25", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add25", 
      "inputs": [[74, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu25", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_14/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_14/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[78, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_14/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape27", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add27", 
      "inputs": [[80, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu27", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_15/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_15/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_15/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape29", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add29", 
      "inputs": [[86, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu29", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_16/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_16/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_16/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape31", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add31", 
      "inputs": [[92, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu31", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_17/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_17/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[96, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_17/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape33", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add33", 
      "inputs": [[98, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu33", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_18/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_18/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[102, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_18/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape35", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add35", 
      "inputs": [[104, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu35", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_19/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_19/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[108, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_19/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape37", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add37", 
      "inputs": [[110, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu37", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_20/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(1, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_20/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[114, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_20/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(1,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape39", 
      "attrs": {"shape": "(1, 1, 1, 1)"}, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add39", 
      "inputs": [[116, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add41", 
      "inputs": [[119, 0, 0], [0, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    7, 
    9, 
    13, 
    15, 
    19, 
    21, 
    25, 
    27, 
    31, 
    33, 
    37, 
    39, 
    43, 
    45, 
    49, 
    51, 
    55, 
    57, 
    61, 
    63, 
    67, 
    69, 
    73, 
    75, 
    79, 
    81, 
    85, 
    87, 
    91, 
    93, 
    97, 
    99, 
    103, 
    105, 
    109, 
    111, 
    115, 
    117
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121
  ], 
  "heads": [[120, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10300]}
}