{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "neg_DIV2K_mean", 
      "attrs": {"__shape__": "(1, 3, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "pre_mean_shift", 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad0", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_0", 
      "attrs": {"__shape__": "(64, 3, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_1", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad1", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_2", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_3", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu0", 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad2", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_4", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_5", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add0", 
      "inputs": [[15, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu1", 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[6, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad3", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_14", 
      "attrs": {"__shape__": "(64, 128, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_15", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu2", 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad4", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_6", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_7", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu3", 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad5", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_8", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_9", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add1", 
      "inputs": [[32, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu4", 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[18, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad6", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_16", 
      "attrs": {"__shape__": "(64, 192, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_17", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution6", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu5", 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad7", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_10", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_11", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution7", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu6", 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad8", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_12", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_13", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution8", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add2", 
      "inputs": [[49, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu7", 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat2", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[35, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad9", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_18", 
      "attrs": {"__shape__": "(64, 256, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_19", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution9", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[53, 0, 0], [54, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu8", 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat3", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[6, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad10", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_56", 
      "attrs": {"__shape__": "(64, 128, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_57", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution10", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[59, 0, 0], [60, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu9", 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad11", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_20", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_21", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution11", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu10", 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad12", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_22", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_23", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution12", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[69, 0, 0], [70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3", 
      "inputs": [[72, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu11", 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat4", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[63, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad13", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_32", 
      "attrs": {"__shape__": "(64, 128, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_33", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution13", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[76, 0, 0], [77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu12", 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad14", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_24", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_25", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution14", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[81, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu13", 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad15", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_26", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_27", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution15", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add4", 
      "inputs": [[89, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu14", 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat5", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[75, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad16", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_34", 
      "attrs": {"__shape__": "(64, 192, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_35", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution16", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[93, 0, 0], [94, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu15", 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad17", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_28", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_29", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution17", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[98, 0, 0], [99, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu16", 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad18", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_30", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_31", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution18", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[103, 0, 0], [104, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add5", 
      "inputs": [[106, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu17", 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat6", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[92, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad19", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_36", 
      "attrs": {"__shape__": "(64, 256, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_37", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution19", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[110, 0, 0], [111, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu18", 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat7", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[58, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad20", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_58", 
      "attrs": {"__shape__": "(64, 192, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_59", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution20", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[116, 0, 0], [117, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu19", 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad21", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_38", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_39", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution21", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[121, 0, 0], [122, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu20", 
      "inputs": [[124, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad22", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_40", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_41", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution22", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[126, 0, 0], [127, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add6", 
      "inputs": [[129, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu21", 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat8", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[120, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad23", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_50", 
      "attrs": {"__shape__": "(64, 128, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_51", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution23", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[133, 0, 0], [134, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu22", 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad24", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[137, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_42", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_43", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution24", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[138, 0, 0], [139, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu23", 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad25", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_44", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_45", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution25", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[143, 0, 0], [144, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add7", 
      "inputs": [[146, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu24", 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat9", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[132, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad26", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_52", 
      "attrs": {"__shape__": "(64, 192, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_53", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution26", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[150, 0, 0], [151, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu25", 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad27", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_46", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_47", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution27", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[155, 0, 0], [156, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu26", 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad28", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_48", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_49", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution28", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[160, 0, 0], [161, 0, 0], [162, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add8", 
      "inputs": [[163, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu27", 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat10", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[149, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad29", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_54", 
      "attrs": {"__shape__": "(64, 256, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_55", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution29", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[167, 0, 0], [168, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu28", 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat11", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[115, 0, 0], [171, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad30", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_60", 
      "attrs": {"__shape__": "(64, 256, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_61", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution30", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[173, 0, 0], [174, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu29", 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad31", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_64", 
      "attrs": {"__shape__": "(576, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_65", 
      "attrs": {"__shape__": "(576,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution31", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "576", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[178, 0, 0], [179, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu30", 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(0, -4, -1, 9, 0, 0)"}, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "(0, 0, -4, 3, 3, 0, 0)"}, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose0", 
      "attrs": {"axes": "(0, 1, 4, 2, 5, 3)"}, 
      "inputs": [[184, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape2", 
      "attrs": {"shape": "(0, 0, -3, -3)"}, 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "learned_70", 
      "attrs": {"__shape__": "(3, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "learned_71", 
      "attrs": {"__shape__": "(3,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution32", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "3", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[186, 0, 0], [187, 0, 0], [188, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DIV2K_mean", 
      "attrs": {"__shape__": "(1, 3, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "post_mean_shift", 
      "inputs": [[189, 0, 0], [190, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    4, 
    5, 
    8, 
    9, 
    13, 
    14, 
    20, 
    21, 
    25, 
    26, 
    30, 
    31, 
    37, 
    38, 
    42, 
    43, 
    47, 
    48, 
    54, 
    55, 
    60, 
    61, 
    65, 
    66, 
    70, 
    71, 
    77, 
    78, 
    82, 
    83, 
    87, 
    88, 
    94, 
    95, 
    99, 
    100, 
    104, 
    105, 
    111, 
    112, 
    117, 
    118, 
    122, 
    123, 
    127, 
    128, 
    134, 
    135, 
    139, 
    140, 
    144, 
    145, 
    151, 
    152, 
    156, 
    157, 
    161, 
    162, 
    168, 
    169, 
    174, 
    175, 
    179, 
    180, 
    187, 
    188, 
    190
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143, 
    144, 
    145, 
    146, 
    147, 
    148, 
    149, 
    150, 
    151, 
    152, 
    153, 
    154, 
    155, 
    156, 
    157, 
    158, 
    159, 
    160, 
    161, 
    162, 
    163, 
    164, 
    165, 
    166, 
    167, 
    168, 
    169, 
    170, 
    171, 
    172, 
    173, 
    174, 
    175, 
    176, 
    177, 
    178, 
    179, 
    180, 
    181, 
    182, 
    183, 
    184, 
    185, 
    186, 
    187, 
    188, 
    189, 
    190, 
    191, 
    192
  ], 
  "heads": [[191, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10300]}
}