{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "attrs": {
        "__dtype__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2d_3/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 1, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "model_5/conv2d_3/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_3/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape63", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add75", 
      "inputs": [[2, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu63", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_4/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "model_5/model_2/conv2d_4/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_4/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape65", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add77", 
      "inputs": [[8, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu65", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_5/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "model_5/model_2/conv2d_5/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_5/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape67", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add79", 
      "inputs": [[14, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add81", 
      "inputs": [[6, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu67", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_6/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(4, 64, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "model_5/conv2d_6/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "4", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_6/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(4,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape69", 
      "attrs": {"shape": "(1, 4, 1, 1)"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add83", 
      "inputs": [[21, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu69", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_transpose_2/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(4, 4, 14, 14)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "model_5/conv2d_transpose_2/conv2d_transpose2", 
      "attrs": {
        "kernel": "(14, 14)", 
        "no_bias": "True", 
        "num_filter": "4", 
        "pad": "(6, 6)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_transpose_2/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(4,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape71", 
      "attrs": {"shape": "(1, 4, 1, 1)"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add85", 
      "inputs": [[27, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu71", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_7/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 4, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "model_5/conv2d_7/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_7/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape73", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add87", 
      "inputs": [[33, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu73", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_8/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "model_5/model_3/conv2d_8/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_8/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape75", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add89", 
      "inputs": [[39, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu75", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_9/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "model_5/model_3/conv2d_9/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_9/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape77", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add91", 
      "inputs": [[45, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add93", 
      "inputs": [[37, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu77", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_10/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "model_5/model_4/conv2d_10/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_10/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape79", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add95", 
      "inputs": [[52, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu79", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_11/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 64, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "model_5/model_4/conv2d_11/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_11/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape81", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add97", 
      "inputs": [[58, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add99", 
      "inputs": [[50, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu81", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_12/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(16, 64, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "model_5/conv2d_12/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_12/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(16,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape83", 
      "attrs": {"shape": "(1, 16, 1, 1)"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add101", 
      "inputs": [[65, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu83", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_13/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(16, 16, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "model_5/conv2d_13/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[69, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_13/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(16,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape91", 
      "attrs": {"shape": "(1, 16, 1, 1)"}, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add109", 
      "inputs": [[71, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu91", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_14/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(16, 16, 1, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "model_5/conv2d_14/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(0, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[69, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_14/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(16,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape89", 
      "attrs": {"shape": "(1, 16, 1, 1)"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add107", 
      "inputs": [[77, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu89", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_15/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(16, 16, 3, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "model_5/conv2d_15/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[81, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_15/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(16,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape93", 
      "attrs": {"shape": "(1, 16, 1, 1)"}, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add111", 
      "inputs": [[83, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu93", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_16/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(16, 16, 1, 5)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "model_5/conv2d_16/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 5)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(0, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[69, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_16/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(16,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape87", 
      "attrs": {"shape": "(1, 16, 1, 1)"}, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add105", 
      "inputs": [[89, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu87", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_17/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(16, 16, 5, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "model_5/conv2d_17/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 1)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(2, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_17/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(16,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape95", 
      "attrs": {"shape": "(1, 16, 1, 1)"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add113", 
      "inputs": [[95, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu95", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_18/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(16, 16, 1, 7)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "model_5/conv2d_18/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 7)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(0, 3)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[69, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_18/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(16,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape85", 
      "attrs": {"shape": "(1, 16, 1, 1)"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add103", 
      "inputs": [[101, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu85", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_19/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(16, 16, 7, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "model_5/conv2d_19/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(7, 1)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(3, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_19/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(16,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape97", 
      "attrs": {"shape": "(1, 16, 1, 1)"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add115", 
      "inputs": [[107, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu97", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat3", 
      "attrs": {
        "dim": "1", 
        "num_args": "4"
      }, 
      "inputs": [[75, 0, 0], [87, 0, 0], [99, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_20/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(1, 64, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "model_5/conv2d_20/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_20/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(1,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape99", 
      "attrs": {"shape": "(1, 1, 1, 1)"}, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add117", 
      "inputs": [[114, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu99", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_1/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(4, 1, 3, 3)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "model_1/conv2d_1/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "4", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_1/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(4,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape7", 
      "attrs": {"shape": "(1, 4, 1, 1)"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add7", 
      "inputs": [[120, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu7", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_transpose_1/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(4, 8, 14, 14)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "model_1/conv2d_transpose_1/conv2d_transpose2", 
      "attrs": {
        "kernel": "(14, 14)", 
        "no_bias": "True", 
        "num_filter": "8", 
        "pad": "(6, 6)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[124, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_transpose_1/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(8,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape9", 
      "attrs": {"shape": "(1, 8, 1, 1)"}, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add9", 
      "inputs": [[126, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu9", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_2/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(1, 8, 5, 5)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "model_1/conv2d_2/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "no_bias": "True", 
        "num_filter": "1", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[130, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_2/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(1,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape11", 
      "attrs": {"shape": "(1, 1, 1, 1)"}, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add11", 
      "inputs": [[132, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu11", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add119", 
      "inputs": [[118, 0, 0], [136, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    7, 
    9, 
    13, 
    15, 
    20, 
    22, 
    26, 
    28, 
    32, 
    34, 
    38, 
    40, 
    44, 
    46, 
    51, 
    53, 
    57, 
    59, 
    64, 
    66, 
    70, 
    72, 
    76, 
    78, 
    82, 
    84, 
    88, 
    90, 
    94, 
    96, 
    100, 
    102, 
    106, 
    108, 
    113, 
    115, 
    119, 
    121, 
    125, 
    127, 
    131, 
    133
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137, 
    138
  ], 
  "heads": [[137, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10300]}
}